In [ ]:

"""
The hidden gem of Pandas are the dataframe.

Bunch of series with shared index."""

In [ ]:
import numpy as np

import pandas as pd

In [29]:
# Random number

arr = np.random.rand(5)

arr2 = np.random.exponential(5)

In [ ]:
print(arr*5)

In [ ]:
print(arr)

In [ ]:
np.random.seed(50)

In [ ]:
arr4 = np.random.randint(5,size =(5))

In [ ]:
print(arr4)

In [ ]:
arr4 = np.random.randint(500, size=(2, 4))

In [ ]:
print(arr4)

In [ ]:
# Creation of the dataframe

In [8]:
import pandas as pd
import numpy as np

In [3]:
data1 = pd.DataFrame({'A':[1,2,3,4],'B':[5,6,7,8],'C':[10123,123123,123123,123123]})

In [4]:
data1

   A  B       C
0  1  5   10123
1  2  6  123123
2  3  7  123123
3  4  8  123123

In [6]:
dates = pd.date_range('20130121', periods=15,freq ='M')
print(dates)

DatetimeIndex(['2013-01-31', '2013-02-28', '2013-03-31', '2013-04-30',
               '2013-05-31', '2013-06-30', '2013-07-31', '2013-08-31',
               '2013-09-30', '2013-10-31', '2013-11-30', '2013-12-31',
               '2014-01-31', '2014-02-28', '2014-03-31'],
              dtype='datetime64[ns]', freq='M')

In [ ]:
dates2 = pd.date_range(start='1/1/2018', end='1/08/2018')

In [ ]:
print(dates2)

In [ ]:
dates3 = pd.date_range(start='1/1/2018', periods=5, tz='Asia/Tokyo')

In [ ]:
print(dates3)

In [9]:
df2 = pd.DataFrame({'A': 1,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),
                    'E': ["test", "1", "test", "train"],
                    'F': 'foo'})
print(df2)

   A          B    C  D      E    F
0  1 2013-01-02  1.0  3   test  foo
1  1 2013-01-02  1.0  3      1  foo
2  1 2013-01-02  1.0  3   test  foo
3  1 2013-01-02  1.0  3  train  foo

In [30]:
index = 'A1 B C D E'.split()
print(index)

['A1', 'B', 'C', 'D', 'E']

In [31]:
df = pd.DataFrame(np.random.randint(200,size = (5,5)),index = 'A1 B C D E'.split(),columns = 'W X Y Z U'.split())

In [32]:
df

      W    X    Y    Z    U
A1   94    0  139  158  154
B    71   51  156  152   91
C   174   62  141  199   36
D   128  186   43  192  147
E    58   45  129  189    9

In [33]:
#df = pd.DataFrame(np.random.randint(200,size = (4,4)),index = 'A B C D'.split(),columns = 'W X Y Z'.split())

In [34]:
print(df['X'])

A1      0
B      51
C      62
D     186
E      45
Name: X, dtype: int32

In [35]:
print(df['W','Z'])

KeyError: ('W', 'Z')

In [36]:
print(df[['Z','W']])

      Z    W
A1  158   94
B   152   71
C   199  174
D   192  128
E   189   58

In [37]:
print(df.Y)

A1    139
B     156
C     141
D      43
E     129
Name: Y, dtype: int32

In [38]:
print(type(df.X))

<class 'pandas.core.series.Series'>

In [ ]:
df

In [39]:
df['Sum_XY'] = df['X'] + df['Y']

In [40]:
df

      W    X    Y    Z    U  Sum_XY
A1   94    0  139  158  154     139
B    71   51  156  152   91     207
C   174   62  141  199   36     203
D   128  186   43  192  147     229
E    58   45  129  189    9     174

In [41]:
df['NEw_X'] = df['X'] + df['Z']

In [42]:
df

      W    X    Y    Z    U  Sum_XY  NEw_X
A1   94    0  139  158  154     139    158
B    71   51  156  152   91     207    203
C   174   62  141  199   36     203    261
D   128  186   43  192  147     229    378
E    58   45  129  189    9     174    234

In [44]:
df2 = df.drop(['Sum_XY'],axis = 1)

In [45]:
df2

      W    X    Y    Z    U  NEw_X
A1   94    0  139  158  154    158
B    71   51  156  152   91    203
C   174   62  141  199   36    261
D   128  186   43  192  147    378
E    58   45  129  189    9    234

In [46]:
df3 = df2.drop(labels = ['A1','B','C'], axis =0)

In [47]:
df3

     W    X    Y    Z    U  NEw_X
D  128  186   43  192  147    378
E   58   45  129  189    9    234

In [48]:
df

      W    X    Y    Z    U  Sum_XY  NEw_X
A1   94    0  139  158  154     139    158
B    71   51  156  152   91     207    203
C   174   62  141  199   36     203    261
D   128  186   43  192  147     229    378
E    58   45  129  189    9     174    234

In [56]:
df = pd.DataFrame(np.random.randint(200,size = (5,5)),index = 'A1 B C D E'.split(),columns = 'W X Y Z U'.split())

In [50]:
# inplace true leads to change the original dataframe and not anything else

df5 = df.drop(labels = ['A1','B'], axis =0,inplace = False)

# inplace false leads to change the new dataframe and not anything else

In [51]:
df

      W    X    Y    Z    U  Sum_XY  NEw_X
A1   94    0  139  158  154     139    158
B    71   51  156  152   91     207    203
C   174   62  141  199   36     203    261
D   128  186   43  192  147     229    378
E    58   45  129  189    9     174    234

In [54]:
df.drop(labels = ['A1','B'], axis =0,inplace = True)

In [55]:
df

     Z    Y    X    W    U  Sum_XY  NEw_X
C  199  141   62  174   36     203    261
D  192   43  186  128  147     229    378
E  189  129   45   58    9     174    234

In [57]:
df = pd.DataFrame(np.random.randint(200,size = (5,5)),index = 'A1 B C D E'.split(),columns = 'W X Y Z U'.split())

In [58]:
df.sort_index(axis=1, ascending=False,inplace = True)

In [59]:
df

      Z    Y    X    W    U
A1   35  171   44  190   27
B   159  156   58   50  143
C   125  183  180    5   56
D   146  132   68   47  111
E    11  174   17   42  155

In [60]:
df.sort_values(by='Y',inplace =True)

In [61]:
df

      Z    Y    X    W    U
D   146  132   68   47  111
B   159  156   58   50  143
A1   35  171   44  190   27
E    11  174   17   42  155
C   125  183  180    5   56

In [63]:
# Selection

# BAsed on the column name

print(df.loc[:,['X','U']])

      X    U
D    68  111
B    58  143
A1   44   27
E    17  155
C   180   56

In [64]:
df

      Z    Y    X    W    U
D   146  132   68   47  111
B   159  156   58   50  143
A1   35  171   44  190   27
E    11  174   17   42  155
C   125  183  180    5   56

In [65]:

# Based on the index hence the i
print(df.iloc[:,:4])

      Z    Y    X    W
D   146  132   68   47
B   159  156   58   50
A1   35  171   44  190
E    11  174   17   42
C   125  183  180    5

In [66]:
print(df.iloc[:,4])

D     111
B     143
A1     27
E     155
C      56
Name: U, dtype: int32

In [67]:
# Conditional Selection

print(df>100)

        Z     Y      X      W      U
D    True  True  False  False   True
B    True  True  False  False   True
A1  False  True  False   True  False
E   False  True  False  False   True
C    True  True   True  False  False

In [68]:
print((df['Y']>100) & (df['Z']>100))

D      True
B      True
A1    False
E     False
C      True
dtype: bool

In [69]:
# Column specific filteration

print(df[df.iloc[:,3]>100])

     Z    Y   X    W   U
A1  35  171  44  190  27

In [70]:
df

      Z    Y    X    W    U
D   146  132   68   47  111
B   159  156   58   50  143
A1   35  171   44  190   27
E    11  174   17   42  155
C   125  183  180    5   56

In [71]:
print(df[df.loc[:,'X']>100])

     Z    Y    X  W   U
C  125  183  180  5  56

In [72]:
print(df[df.loc[:,'Y']>50])

      Z    Y    X    W    U
D   146  132   68   47  111
B   159  156   58   50  143
A1   35  171   44  190   27
E    11  174   17   42  155
C   125  183  180    5   56

In [73]:
print(df.X>100)

D     False
B     False
A1    False
E     False
C      True
Name: X, dtype: bool

In [ ]:
df

In [74]:
df

      Z    Y    X    W    U
D   146  132   68   47  111
B   159  156   58   50  143
A1   35  171   44  190   27
E    11  174   17   42  155
C   125  183  180    5   56

In [75]:
df['NEw_X'] = df['X'] + df['Z']

In [76]:
df

      Z    Y    X    W    U  NEw_X
D   146  132   68   47  111    214
B   159  156   58   50  143    217
A1   35  171   44  190   27     79
E    11  174   17   42  155     28
C   125  183  180    5   56    305

In [79]:
print(df[(df['W']>50) | (df['Y']<150)]['NEw_X'])

D     214
A1     79
Name: NEw_X, dtype: int32

In [80]:
print(df[df.loc[:,'X']<100]['NEw_X'])

D     214
B     217
A1     79
E      28
Name: NEw_X, dtype: int32

In [81]:
print(df[(df['W']>50) & (df['Y']<150)])

Empty DataFrame
Columns: [Z, Y, X, W, U, NEw_X]
Index: []

In [ ]:
#df['F',:] = df['A',:] + df['B',:]

In [82]:
df7 = df.reset_index()

In [83]:
df7

  index    Z    Y    X    W    U  NEw_X
0     D  146  132   68   47  111    214
1     B  159  156   58   50  143    217
2    A1   35  171   44  190   27     79
3     E   11  174   17   42  155     28
4     C  125  183  180    5   56    305

In [93]:
new_index = 'AMD PUNE HYD BLR MUM SURAT '.split()

In [94]:
#df7 = df.reindex(new_index)

In [95]:
df.columns = new_index

In [96]:
df

    AMD  PUNE  HYD  BLR  MUM  SURAT
D   146   132   68   47  111    214
B   159   156   58   50  143    217
A1   35   171   44  190   27     79
E    11   174   17   42  155     28
C   125   183  180    5   56    305

In [97]:
df['Cities'] = new_index

ValueError: Length of values does not match length of index

In [ ]:
df

In [ ]:
df8 = df.set_index('Cities')

In [ ]:
df8

In [98]:
# Multi-Index and Index Hierarchy

# zip command

A = [1,2,3]

B = [4,5,6]

In [100]:
print(zip(A,B))

<zip object at 0x000001C727994F48>

In [102]:
C =list(zip(A,B))

In [103]:
C

[(1, 4), (2, 5), (3, 6)]

In [104]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']

inside = [1,'Q',3,1,'Q',3]

outside1 = ['C1','C1','C1','C2','C2','C2']

inside1 = ['P',5,6,4,5,6]

In [105]:
col_index = list(zip(outside1,inside1))

In [107]:
col_index

[('C1', 'P'), ('C1', 5), ('C1', 6), ('C2', 4), ('C2', 5), ('C2', 6)]

In [108]:
col_index =pd.MultiIndex.from_tuples(col_index)

In [112]:
col_index

MultiIndex([('C1', 'P'),
            ('C1',   5),
            ('C1',   6),
            ('C2',   4),
            ('C2',   5),
            ('C2',   6)],
           )

In [113]:
hier_index = list(zip(outside,inside))

hier_index = pd.MultiIndex.from_tuples(hier_index)

In [114]:
hier_index

MultiIndex([('G1',   1),
            ('G1', 'Q'),
            ('G1',   3),
            ('G2',   1),
            ('G2', 'Q'),
            ('G2',   3)],
           )

In [115]:
df10 = pd.DataFrame(np.random.randn(6,6),index=hier_index,columns=col_index)

In [116]:
df10

            C1                            C2
             P         5         6         4         5         6
G1 1  1.495261  1.657791  0.350091 -0.615772 -0.548606  1.626519
   Q -0.447805  0.532862  1.046479  0.256381  0.294445 -1.475183
   3 -1.344729 -0.728614  0.709225  0.278169 -0.562807 -0.164676
G2 1  0.924265 -0.802064  0.837406  0.156378  0.710103 -1.552583
   Q  0.614823  0.030415 -0.527517  1.505000 -1.539935  0.364941
   3  0.108311 -1.716415  0.162722 -0.494644 -0.710517  1.214242

In [117]:
print(df10.loc['G2']['C1','P'])

1    0.924265
Q    0.614823
3    0.108311
Name: (C1, P), dtype: float64

In [118]:
print(df10.loc['G2','C1'])

          P         5         6
1  0.924265 -0.802064  0.837406
Q  0.614823  0.030415 -0.527517
3  0.108311 -1.716415  0.162722

In [119]:
print(df10.loc['G2','C1','P'])

IndexingError: Too many indexers

In [120]:
print(df10.loc['G2','C1']['P'])

1    0.924265
Q    0.614823
3    0.108311
Name: P, dtype: float64

In [121]:
df10

            C1                            C2
             P         5         6         4         5         6
G1 1  1.495261  1.657791  0.350091 -0.615772 -0.548606  1.626519
   Q -0.447805  0.532862  1.046479  0.256381  0.294445 -1.475183
   3 -1.344729 -0.728614  0.709225  0.278169 -0.562807 -0.164676
G2 1  0.924265 -0.802064  0.837406  0.156378  0.710103 -1.552583
   Q  0.614823  0.030415 -0.527517  1.505000 -1.539935  0.364941
   3  0.108311 -1.716415  0.162722 -0.494644 -0.710517  1.214242

In [122]:
print(df10.loc['G2','Q']['C1','P'])

0.614822748096385

In [123]:
df10

            C1                            C2
             P         5         6         4         5         6
G1 1  1.495261  1.657791  0.350091 -0.615772 -0.548606  1.626519
   Q -0.447805  0.532862  1.046479  0.256381  0.294445 -1.475183
   3 -1.344729 -0.728614  0.709225  0.278169 -0.562807 -0.164676
G2 1  0.924265 -0.802064  0.837406  0.156378  0.710103 -1.552583
   Q  0.614823  0.030415 -0.527517  1.505000 -1.539935  0.364941
   3  0.108311 -1.716415  0.162722 -0.494644 -0.710517  1.214242

In [124]:
print(df10.iloc[:,3][1])

0.25638108481013305

In [125]:
print(df10.index)

MultiIndex([('G1',   1),
            ('G1', 'Q'),
            ('G1',   3),
            ('G2',   1),
            ('G2', 'Q'),
            ('G2',   3)],
           )

In [126]:
# giving index names

df10.reset_index(level = 1)

   level_1        C1                            C2
                   P         5         6         4         5         6
G1       1  1.495261  1.657791  0.350091 -0.615772 -0.548606  1.626519
G1       Q -0.447805  0.532862  1.046479  0.256381  0.294445 -1.475183
G1       3 -1.344729 -0.728614  0.709225  0.278169 -0.562807 -0.164676
G2       1  0.924265 -0.802064  0.837406  0.156378  0.710103 -1.552583
G2       Q  0.614823  0.030415 -0.527517  1.505000 -1.539935  0.364941
G2       3  0.108311 -1.716415  0.162722 -0.494644 -0.710517  1.214242

In [127]:
df10

            C1                            C2
             P         5         6         4         5         6
G1 1  1.495261  1.657791  0.350091 -0.615772 -0.548606  1.626519
   Q -0.447805  0.532862  1.046479  0.256381  0.294445 -1.475183
   3 -1.344729 -0.728614  0.709225  0.278169 -0.562807 -0.164676
G2 1  0.924265 -0.802064  0.837406  0.156378  0.710103 -1.552583
   Q  0.614823  0.030415 -0.527517  1.505000 -1.539935  0.364941
   3  0.108311 -1.716415  0.162722 -0.494644 -0.710517  1.214242

In [128]:
df

    AMD  PUNE  HYD  BLR  MUM  SURAT
D   146   132   68   47  111    214
B   159   156   58   50  143    217
A1   35   171   44  190   27     79
E    11   174   17   42  155     28
C   125   183  180    5   56    305

In [131]:
# Row operations

df11 = df.pivot_table(index = 'AMD', columns = 'BLR', values = 'MUM')

In [132]:
df11

BLR   5      42     47     50    190
AMD
11    NaN  155.0    NaN    NaN   NaN
35    NaN    NaN    NaN    NaN  27.0
125  56.0    NaN    NaN    NaN   NaN
146   NaN    NaN  111.0    NaN   NaN
159   NaN    NaN    NaN  143.0   NaN

In [ ]:
df11

In [133]:
# Adding a row

F = { 'W': 1, 'X': 2,'Y': 3,'Z':4 }

df = df.append(F, ignore_index = True)

In [134]:
df

     AMD   PUNE    HYD    BLR    MUM  SURAT    W    X    Y    Z
0  146.0  132.0   68.0   47.0  111.0  214.0  NaN  NaN  NaN  NaN
1  159.0  156.0   58.0   50.0  143.0  217.0  NaN  NaN  NaN  NaN
2   35.0  171.0   44.0  190.0   27.0   79.0  NaN  NaN  NaN  NaN
3   11.0  174.0   17.0   42.0  155.0   28.0  NaN  NaN  NaN  NaN
4  125.0  183.0  180.0    5.0   56.0  305.0  NaN  NaN  NaN  NaN
5    NaN    NaN    NaN    NaN    NaN    NaN  1.0  2.0  3.0  4.0